export const payeeCategoryObj = {
  10320005: "A:收款",
  10320010: "C:保证金",
  10320015: "R:供应商退款",
  10320020: "X:资金往来(其他应收-资金调拨)",
  10320025: "Y:部门内部支付（部门间交易单）",
  10320030: "Q:收到往来款（其他应收款-单位往来）",
  10320035: "T:收到往来款（其他应付款-单位往来)"
};
export const contractCatObj = {
  10150005: "国内销售",
  10150010: "出口销售",
  10150015: "码单销售",
  10150020: "零售销售",
  10150025: "配供业务",
  10150030: "现款现货"

}
export const contractStatusObj = {
  10130005: "草拟",
  10130010: "审批中",
  10130015: "已生效",
  10130020: "审批后修改",
  10130025: "变更审批中",
  10130030: "关闭中",
  10130035: "已截停",
  10130040: "开启中",
  10130045: "已驳回",
  10130050: "已关闭"
}
export const poTypeObj = {
  10140005: "内贸采购",
  10140010: "进口采购"
}
export const pickupTypeObj = {
  10610005: "自提",
  10610010: "送达",
  10610015: "港口直发",
  10610020: "供应商直发"
}
export const invoiceTypeObj = {
  10700005: "标准发票",
  10700010: "退货发票",
  10700015: "事后借记",
  10700020: "事后贷记"
}
export const soInvoiceStatusObj = {
  10710005: "保存",
  10710010: "已提交",
  10710015: "已过账",
  10710020: "已驳回",
  10710025: "已冲销"
}
export const poInvoiceStatusObj = {
  10810005: "保存",
  10810010: "审核中",
  10810015: "已审核",
  10810020: "已冲销",
  10810025: "已驳回"
}
export const warehouseTypeObj = {
  10790005: "采购入库",
  10790050: "采购退货",
  10790080: "其他入库",
  10790090: "其他出库",
  10790140: "销售出库",
  10790165: "销售退货",
  10790175: "盘盈",
  10790180: "盘亏",
  10790185: "调拨-出库",
  10790190: "调拨-入库",
  10790195: "移库-出库",
  10790196: "移库-入库"
}