export const payeeCategoryObj = {
  10320005: "A:收款",
  10320010: "C:保证金",
  10320015: "R:供应商退款",
  10320020: "X:资金往来(其他应收-资金调拨)",
  10320025: "Y:部门内部支付（部门间交易单）",
  10320030: "Q:收到往来款（其他应收款-单位往来）",
  10320035: "T:收到往来款（其他应付款-单位往来)"
};
export const statusObj = {
  10330005: "收款",
  10330010: "收款过账",
  10330015: "收款冲销",
  10330020: "部分认领",
  10330025: "完全认领"
};
export const sharedStatusObj = {
  0: "待认领",
  1: "部分认领",
  2: "完全认领",
};
export const typeObj = {
  10310005: "A:现金结算",
  10310010: "B:银行承兑汇票",
  10310015: "C:现金支票",
  10310020: "D:商业承兑汇票",
  10310025: "E:转帐支票",
  10310030: "F:银行本票",
  10310035: "G:电汇结算",
  10310040: "H:银行汇票",
  10310045: "I:票据转让",
  10310050: "J:委托收款",
  10310055: "K:信用卡",
  10310060: "L:信用证L/C",
  10310065: "M:借 贷 款",
  10310070: "N:D/A",
  10310075: "O:D/D",
  10310080: "P:D/P",
  10310085: "Q:M/T",
  10310090: "T:T/T A",
  10310095: "U:结转",
  10310100: "V:T/T B",
  10310105: "X:混合付款",
  10310110: "L/C AFTER B/L OR D/O DATE",
  10310115: "L/C AFTER SIGH",
  10310120: "3:应收款链"
};
export const payeeTypeObj = {
  10310005: "A:现金结算",
  10310010: "B:银行承兑汇票",
  10310015: "C:现金支票",
  10310020: "D:商业承兑汇票",
  10310025: "E:转帐支票",
  10310030: "F:银行本票",
  10310035: "G:电汇结算",
  10310040: "H:银行汇票",
  10310045: "I:票据转让",
  10310050: "J:委托收款",
  10310055: "K:信用卡",
  10310060: "L:信用证L/C",
  10310065: "M:借 贷 款",
  10310070: "N:D/A",
  10310075: "O:D/D",
  10310080: "P:D/P",
  10310085: "Q:M/T",
  10310090: "T:T/T A",
  10310095: "U:结转",
  10310100: "V:T/T B",
  10310105: "X:混合付款",
  10310110: "L/C AFTER B/L OR D/O DATE",
  10310115: "L/C AFTER SIGH",
  10310120: "3:应收款链"
};
export const crashContentObj = {
  10360005: "AA:货款",
  10360010: "AB:保证金",
  10360015: "AC:客户退款",
  10360019: "AD:保证金-其他",
  10360020: "B1:货代代理费",
  10360025: "B2:检验费",
  10360030: "BA:海运费",
  10360035: "BB:保险费",
  10360040: "BC:佣金",
  10360045: "BD:装卸费",
  10360050: "BE:仓储费",
  10360055: "BF:港杂费",
  10360060: "BG:运杂费",
  10360065: "BH:国内运费",
  10360070: "BI:报关费",
  10360075: "BJ:商检费",
  10360080: "BK:许可证费",
  10360085: "BL:出口关税",
  10360090: "BM:进口关税",
  10360095: "BP:滞报费",
  10360100: "BQ:进口增值税",
  10360105: "BR:样品费",
  10360110: "BS:国际海运费",
  10360115: "BT:国内船运费",
  10360120: "BU:国内陆运费(火车)",
  10360125: "BV:国内陆运费(汽车)",
  10360130: "BW:空运费",
  10360135: "BZ:滞期费",
  10360140: "CD:返利",
  10360145: "CZ:其他费用",
  10360150: "XC:公司内部调拨",
  10360155: "XD:公司间往来",
  10360160: "TBBS:投标标书费用",
  10360165: "TBBZJ:投标保证金"
};
export const claimStatusObj = {
  10520005: "保存",
  10520010: "已提交",
  10520015: "已审核",
  10520020: "已驳回"
};
export const docTypeObj = {
  10530005: "销售合同",
  10530010: "销售发票",
  10530015: "采购订单",
  10530020: "费用订单"
};
export const applyStatusObj = {
  10460005: "保存",
  10460010: "审核中",
  10460015: "已审核",
  10460020: "已驳回",
  10460025: "已付款"
};
export const applyInvoiceTypeObj = {
  10540005: "框架协议",
  10540010: "采购订单",
  10540015: "销售订单",
  10540020: "费用明细"
};
export const paymentTypeObj = {
  10500005: "A 供应商预付款 ",
  10500010: "P 供应商付款 ",
  10500015: "R 客户退款 ",
  10500020: "C 保证金 ",
  10500025: "D 客户保证金（环能专用） ",
  10500030: "Y 部门内部支付（部门间交易单） ",
  10500035: "Z 资金往来(其他应收-资金调拨) ",
  10500040: "Q 退回往来款（其他应收款-单位往来） ",
  10500045: "T 退回往来款（其他应付款-单位往来） ",
  10500050: "X 税款"
};
export const payTypeObj = {
  10310005: "A:现金结算",
  10310010: "B:银行承兑汇票",
  10310015: "C:现金支票",
  10310020: "D:商业承兑汇票",
  10310025: "E:转帐支票",
  10310030: "F:银行本票",
  10310035: "G:电汇结算",
  10310040: "H:银行汇票",
  10310045: "I:票据转让",
  10310050: "J:委托收款",
  10310055: "K:信用卡",
  10310060: "L:信用证L/C",
  10310065: "M:借 贷 款",
  10310070: "N:D/A",
  10310075: "O:D/D",
  10310080: "P:D/P",
  10310085: "Q:M/T",
  10310090: "T:T/T A",
  10310095: "U:结转",
  10310100: "V:T/T B",
  10310105: "X:混合付款",
  10310110: "L/C AFTER B/L OR D/O DATE",
  10310115: "L/C AFTER SIGH",
  10310120: "3:应收款链"
};
export const payStatusObj = {
  10490005: "付款",
  10490010: "付款过账",
  10490015: "付款冲销",
};
export const invoiceTypeObj = {
  10840005: "B-银行承兑",
  10840010: "D-商业承兑",
  10870005: "B-银行承兑",
  10870010: "D-商业承兑",
  10870015: "3:应收款链"
}
export const invoicePropertiesObj = {
  10830005: "A-纸票",
  10830010: "B-电票"
}
export const billStatusObj = {
  10820005: "登记",
  10820010: "付款过账",
  10820015: "认领",
  10820020: "已冲销"
}
export const instrumentStatusObj = {
  10270005: "申请",
  10270010: "登记",
  10270015: "认领",
  10270020: "贴现",
  10270025: "背书",
  10270030: "托收",
  10270035: "质押",
  10270040: "赎回",
  10270045: "内部贴现"
}
export const salesTypeObj = {
  10720005: "购汇",
  10720010: "结汇"
}
export const salesStatusObj = {
  10730005: "保存",
  10730010: "已提交",
  10730015: "已审批",
  10730020: "已驳回",
  10730025: "已执行"
}
export const businessTypeObj = {
  10740005: "采购业务",
  10740010: "销售业务",
  10740015: "信用证",
  10740020: "其他业务"
}
export const executeTypeObj = {
  10750005: "正常",
  10750010: "展期",
  10750015: "违约"
}
export const executeDocTypeObj = {
  10760005: "信用证",
  10760010: "付款单",
}
export const planTypeObj = {
  11510005: "年计划",
  11510010: "月计划",
  11510015: "周计划"
}
export const planStatusObj = {
  11540005: "已保存",
  11540010: "审核中",
  11540015: "已审核",
  11540020: "已驳回"
}
export const bizTypeObj = {
  11550005: "外部收付",
  11550010: "内部收付"
}
export const incomeTypeObj = {
  11560005: "收款",
  11560010: "付款"
}
export const projectTypeObj = {
  11520005: "销售",
  11520010: "采购",
  11520015: "费用",
  11520020: "融资",
  11520025: "投资",
  11520030: "装修款",
  11520035: "薪酬福利",
  11520040: "房租",
  11520045: "接待费报销",
  11520050: "其他"
}
export const fundTypeObj = {
  11530005: "现款",
  11530010: "银行承兑汇票",
  11530015: "商业承兑汇票",
  11530020: "国内信用证",
  11530025: "国际信用证（即期证交单）",
  11530030: "国际信用证（远期证交单承兑）",
  11530035: "其他"
}